src/DataProcessors/КонструкторМоделиЗапросаSQL/КонструкторМоделиЗапросаSQL.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>КонструкторМоделиЗапросаSQL</name>
  <attributes>
    <name>ТекстЗапроса</name>
    <type>
      <types>TextDocument</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстМодели</name>
    <type>
      <types>TextDocument</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСУБД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сервер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяБазыДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АутентификацияNTLM</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СмещениеДат2000</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатJSON</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

src/DataProcessors/КонструкторМоделиЗапросаSQL/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ПолучитьТекстЗапроса(Команда)
	ПолучитьТекстЗапросаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолучитьТекстЗапросаНаСервере()
	//@skip-check module-unused-local-variable
	Перем Результат;
	Если ЗначениеЗаполнено(Объект.РезультатJSON) Тогда
		Результат = ОбщийКлиентСервер.JSONВОбъект(Объект.РезультатJSON);
	КонецЕсли;
	МодельЗапросаSQL = Обработки.МодельЗапросаSQL.Создать();
	МодельЗапроса = МодельЗапросаSQL;
	//@skip-check server-execution-safe-mode
	Выполнить(Объект.ТекстМодели.ПолучитьТекст());
	Объект.ТекстЗапроса.УстановитьТекст(МодельЗапросаSQL.ПолучитьТекстЗапросаПакета());	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьМетаданныеПеречислений(Команда)
	ОткрытьФорму("Обработка.ПолучитьМетаданныеПеречислений.Форма");
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.ТипСУБД = "SQLServer";
	Объект.АутентификацияNTLM = Истина;
	Объект.СмещениеДат2000 = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗапрос(Команда)
	ТекстЗапроса = Объект.ТекстЗапроса.ПолучитьТекст(); 
	СоединениеADODB = РаботаС_ADODB.Соединение(
		Объект.ТипСУБД, 
		Объект.Сервер, 
		Объект.ИмяБазыДанных, 
		Объект.ИмяПользователя, 
		Объект.Пароль, 
		Объект.АутентификацияNTLM
	);
	Таблица = РаботаС_ADODB.ВыполнитьЗапрос(СоединениеADODB, ТекстЗапроса);
	РаботаС_ADODB.ЗакрытьСоединение(СоединениеADODB);
	Если Таблица = Неопределено Тогда
		Объект.РезультатJSON = "";
		Возврат;
	КонецЕсли;
	Объект.РезультатJSON = ОбщийКлиентСервер.ОбъектВJSON(Таблица);
КонецПроцедуры

&НаСервере
Процедура ВывестиЗаголовок(ТабличныйДокумент, Заголовок)
	Секция = ТабличныйДокумент.ПолучитьОбласть("R1");
	Секция.Область("R1C1").Текст = Заголовок;
	ТабличныйДокумент.Вывести(Секция);
КонецПроцедуры

&НаСервере
Процедура ВывестиТаблицу(ТабличныйДокумент, Таблица, Заголовок)
	ВывестиЗаголовок(ТабличныйДокумент, Заголовок);	
	Построитель = Новый ПостроительОтчета;
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(Таблица);       
	Построитель.Вывести(ТабличныйДокумент);
КонецПроцедуры

&НаСервере
Функция ПолучитьРезультат()
	Таблица = Общий.СтруктураВТаблицуЗначений(Объект.РезультатJSON);
	Результат = Новый ТабличныйДокумент;
	ВывестиТаблицу(Результат, Таблица, "Результат");
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура Печать(Команда)
	Результат = ПолучитьРезультат();
	Результат.Показать();
КонецПроцедуры
